{"meta":{"title":"Hexo Web","subtitle":null,"description":null,"author":"Sliexe","url":"http://youtube.com"},"pages":[{"title":"About Me","date":"2019-01-26T02:55:51.000Z","updated":"2019-02-11T09:33:01.012Z","comments":true,"path":"about/index.html","permalink":"http://youtube.com/about/index.html","excerpt":"","text":"My name is Silent, I’m a beginner web programmer and unity. I am from a student school at SMK RUS KUDUS, Central Java, Indonesia. Peace Regards!!!"}],"posts":[{"title":"How to make Hexo Web","slug":"How-to-make-Hexo-Web","date":"2019-02-11T07:28:09.000Z","updated":"2019-02-13T09:41:46.459Z","comments":true,"path":"2019/02/11/How-to-make-Hexo-Web/","link":"","permalink":"http://youtube.com/2019/02/11/How-to-make-Hexo-Web/","excerpt":"","text":"Hello Everybody. Welcome to web hexo. Hexo it’s so simple. Berikut ini cara membuat web Hexo: 1. Membuat Akun dan Repository GithubDengan membuat akun Github jika sudah membuat akun, berikutnya buat file Repository Github:Profile &gt; Your Repositories &gt; New Repository &gt; Isikan Nama Repository &gt; Create Repository LI3.png (New Repositories)LI2.png (Create Repositories) 2. Install NodeJS and HexoDownload software tersebut:-NodeJS Masuk ke Hexo : Masuk ke Command Prompt ketik perintah install HexoUntuk menge-check sudah terinstall dan versi Hexo 3. How to Hexo webBuat folder untuk asset file web hexo seperti gambar dibawah ini:- -Folder yang telah dibuat, masuk ke dalam Command Prompt untuk membuat Hexo web tersebut.Untuk memulai Hexo web kalian, masukan command: hexo server maka ada running localhost:4000 masukan command tersebut dari itulah web server Hexo kamu. 4.Install Hexo Theme and DeployCari themes hexo di website Hexo Themes. Sebelum lanjut kamu harus download text editor untuk editing script web hexo kamu. Saya pakai atom, untuk rekomendasi text editor pakailah atom atau notepad++ (Untuk mendowload Atom Click here) Untuk Install Themes Hexo kalian lakukan lah sesuai instruksi tersebut contoh Install Themes Archer : Perintah instalasi ke command untuk penginstallan &gt; npm i hexo-generator-json-content –save &amp;&amp; npm i –save hexo-wordcount &amp;&amp; git clone https://github.com/fi3ework/hexo-theme-archer.git themes/archer. Di dalam script folder web kamu ada _config.yml masuk ke text editor dan ubah bagian theme yang kalian pakai themes: Archer. Deploy 1.hexo generate –watch2.hexo clean3.hexo deploySetelah mendeploy untuk yang pertama kali akan disuruh masuk ke akun github, dan folder website kalian akan masuk Repository Github, dengan nama kalian buat masuk alamat website kamu username-kalian.github.io. 5. Make a PostMasukan perintah di command hexo new post “judul kalian”, dengan begitu telah terbuat script di folder web kalian : source &gt; _posts &gt; judul-post-kalian. Jika kalian ingin menaruh gambar ke postingan kalian, dengan pindahkan gambar ke dalam folder script post kalian. Kemudian pada script post tambahkan:Akan ada input command img enter.(LI11.png)Maka akan ada command range dan isikan gambar kalian seperti di gambar atas.(LI12.png) 6. Enable on AboutDi-tema saya mengaktifkan about, dengan membuat post baru:hexo new page “about” &gt; layout :aboutDan masuk ke _config.yml mengubah about menjadi trueabout: enable: false image: /FolderGambar/Wallpaper-Kalian.png Sampai itu tutorial Hexo saya. Bye-bye….","categories":[],"tags":[]},{"title":"Post Baruku","slug":"Post-Baruku/index","date":"2019-02-11T07:28:09.000Z","updated":"2019-02-12T10:14:14.411Z","comments":true,"path":"2019/02/11/Post-Baruku/index/","link":"","permalink":"http://youtube.com/2019/02/11/Post-Baruku/index/","excerpt":"","text":"Example :","categories":[],"tags":[]},{"title":"Hello Website Hexo","slug":"hello-world","date":"2019-01-03T05:28:30.741Z","updated":"2019-01-10T03:30:08.236Z","comments":true,"path":"2019/01/03/hello-world/","link":"","permalink":"http://youtube.com/2019/01/03/hello-world/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[],"tags":[]}]}